perkowitz/hachi-yaeltex/hardware/yaeltex/samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cpu=Processor

## Kilomux Board

kilomux.name=Kilomux
kilomux.vid.0=0x04D8
kilomux.pid.0=0xEBBA
kilomux.vid.1=0x04D8
kilomux.pid.1=0xEBCA
kilomux.vid.2=0x04D8
kilomux.pid.2=0xEBCB
kilomux.vid.3=0x04D8
kilomux.pid.3=0xEBCC
kilomux.vid.4=0x04D8
kilomux.pid.4=0xEBCD
kilomux.vid.5=0x04D8
kilomux.pid.5=0xEBCE
kilomux.vid.6=0x04D8
kilomux.pid.6=0xEBCF
kilomux.vid.7=0x04D8
kilomux.pid.7=0xEBD0
kilomux.vid.8=0x04D8
kilomux.pid.8=0xEBD1
kilomux.vid.9=0x04D8
kilomux.pid.9=0xEBDE
kilomux.vid.10=0x04D8
kilomux.pid.10=0xEBDF
kilomux.vid.11=0x04D8
kilomux.pid.11=0xE7B7
kilomux.vid.12=0x04D8
kilomux.pid.12=0xE7B8
kilomux.vid.13=0x04D8
kilomux.pid.13=0xE7B9
kilomux.vid.14=0x04D8
kilomux.pid.14=0xE7BA
kilomux.vid.15=0x04D8
kilomux.pid.15=0xE7BB
#kilomux.upload.tool=bossac
#kilomux.upload.protocol=sam-ba
#kilomux.upload.maximum_size=262144
#kilomux.upload.use_1200bps_touch=true
#kilomux.upload.wait_for_upload_port=true
#kilomux.upload.native_usb=true
kilomux.build.mcu=cortex-m0plus
kilomux.build.f_cpu=48000000L
kilomux.build.usb_product="KilomuxV2"
kilomux.build.usb_manufacturer="Yaeltex"
kilomux.build.board=kilomux
kilomux.build.core=arduino
kilomux.build.openocdscript=openocd_scripts/arduino_zero.cfg
kilomux.build.variant=YAELTEXV2
kilomux.build.variant_system_lib=
kilomux.build.extra_combine_flags=
kilomux.build.vid=0x04D8
kilomux.build.pid=0xEBBA
kilomux.build.extra_flags=-DKILOMUX -D__SAMD21G18A__ {build.usb_flags}
kilomux.bootloader.tool=
kilomux.bootloader.file=zero\samd21_sam_ba.bin

## Kilomux SAMD21 (Yaeltex Bootloader)
## --------------------------
kilomux.menu.cpu.samd21_xtal_ytx=SAMD21 (Yaeltex Bootloader)
kilomux.menu.cpu.samd21_xtal_ytx.build.ldscript=linker_scripts/gcc/flash_with_bootloader_ytx.ld

## Kilomux SAMD21 (Arduino Bootloader)
## --------------------------
kilomux.menu.cpu.samd21_xtal_arduino=SAMD21 (Arduino Bootloader)
kilomux.menu.cpu.samd21_xtal_arduino.build.ldscript=linker_scripts/gcc/flash_with_bootloader_arduino.ld




## iElement Board

ielement.name=iElement
ielement.vid.0=0x04D8
ielement.pid.0=0xEBBA
ielement.build.mcu=cortex-m0plus
ielement.build.f_cpu=48000000L
ielement.build.usb_product="iElementV2"
ielement.build.usb_manufacturer="Yaeltex"
ielement.build.board=ielement
ielement.build.core=arduino
ielement.build.openocdscript=openocd_scripts/arduino_zero.cfg
ielement.build.variant=YAELTEXV2
ielement.build.variant_system_lib=
ielement.build.extra_combine_flags=
ielement.build.vid=0x04D8
ielement.build.pid=0xEBBA
ielement.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
ielement.bootloader.tool=
ielement.bootloader.file=zero\samd21_sam_ba.bin

## iElement SAMD21 (No Bootloader)
## --------------------------
ielement.menu.cpu.samd21_xtal_nb=SAMD21 (No Bootloader)
ielement.menu.cpu.samd21_xtal_nb.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}

## iElement SAMD21 CRYSTALLESS (No Bootloader)
## --------------------------
ielement.menu.cpu.samd21_xtalless_nb=SAMD21 CRYSTALLESS (No Bootloader)
ielement.menu.cpu.samd21_xtalless_nb.build.extra_flags=-DCRYSTALLESS -D__SAMD21G18A__ {build.usb_flags}